Repository: kenzok8/openwrt-packages
Catalog: luci-app-argon-config/po/*/argon-config.po
Languages: pl_pl, ru

source: 0 transparent - 1 opaque (suggest: black translucent preset: 0.5).
pl_pl: 0 przezroczysty - 1 nieprzezroczysty (sugerowane: czarny półprzezroczysty preset: 0.5).
ru: 0 — прозрачно, 1 — непрозрачно (рекомендуется: чёрный полупрозрачный, предустановка: 0.5).

source: 0 transparent - 1 opaque (suggest: transparent: 0 or translucent preset: 0.5).
pl_pl: 0 przezroczysty - 1 nieprzezroczysty (sugerowane: przezroczysty: 0 lub półprzezroczysty preset: 0.5).
ru: 0 — прозрачно, 1 — непрозрачно (рекомендуется: прозрачный 0 или полупрозрачный, предустановка: 0.5).

source: A HEX Color (default: #483d8b).
pl_pl: Kolor zapisany za pomocą kodu HEX (domyślnie: #483d8b).
ru: HEX-цвет (родной: #483d8b).

source: A HEX color (default: #5e72e4).
pl_pl: Kolor zapisany za pomocą kodu HEX (domyślnie: #5e72e4).
ru: HEX-цвет (родной: #5e72e4).

source: Action
pl_pl: Akcja
ru: Действие

source: Argon Config
pl_pl: Konfiguracja Argon
ru: тема Argon

source: Argon theme configuration
pl_pl: Konfiguracja motywu Argon
ru: Конфигурация темы Argon

source: Background file list
pl_pl: Lista plików tła
ru: Список файлов фона

source: Built-in
pl_pl: Wbudowane
ru: Встроенные

source: Dark mode
pl_pl: Ciemny motyw
ru: Тёмная тема

source: Delete
pl_pl: Usuń
ru: Удалить

source: Expecting: %s
pl_pl: Spodziewano się: %s
ru: Ожидалось: %s

source: Failed to upload file: %s.
pl_pl: Nie udało się przesłać pliku: %s.
ru: Не удалось загрузить файл: %s.

source: Filename
pl_pl: Nazwa pliku
ru: Имя файла

source: Files will be uploaded to <code>%s</code>.
pl_pl: Pliki zostaną przesłane do <code>%s</code>.
ru: Файлы будут загружены в <code>%s</code>.

source: Follow system
pl_pl: Użyj ustawień systemu
ru: Как в системе

source: Grant UCI access for luci-app-argon-config
pl_pl: Zezwól na dostęp UCI dla luci-app-argon-config
ru: Предоставить доступ к UCI для luci-app-argon-config

source: Here you can set the blur and transparency of the login page of argon theme, and manage the background pictures and videos. Chrome is recommended.
pl_pl: Tutaj możesz ustawić rozmycie i przezroczystość strony logowania motywu Argon, oraz zarządzać obrazami i filmami tła. Zalecana jest przeglądarka Chrome.
ru: Здесь можно настроить размытие и прозрачность страницы логина темы Argon, управлять фоновыми изображениями и видео. Рекомендуется использовать Chrome.

source: Larger value will more blurred (suggest: clear: 1 or blur preset: 10).
pl_pl: Większa wartość oznacza mocniejsze rozmycie (sugerowane wartości: 1 – brak rozmycia, 10 – domyślny poziom rozmycia).
ru: Выше цифра, сильнее размыто (от чёткого: 1 к размытому: 10).

source: Light mode
pl_pl: Jasny motyw
ru: Светлая тема

source: Modified date
pl_pl: Data modyfikacji
ru: Дата изменения

source: No files found.
pl_pl: Nie znaleziono plików.
ru: Файлы не найдены.

source: Save current settings
pl_pl: Zapisz bieżące ustawienia
ru: Сохранить текущие настройки

source: Save settings
pl_pl: Zapisz ustawienia
ru: Сохранить настройки

source: Size
pl_pl: Rozmiar
ru: Размер

source: Theme configuration
pl_pl: Konfiguracja motywu
ru: Конфигурация темы

source: Theme mode
pl_pl: Tryb motywu
ru: Режим темы

source: Upload background
pl_pl: Prześlij tło
ru: Загрузить фон

source: Upload background (available space: %1024.2mB)
pl_pl: Prześlij tło (dostępne miejsce: %1024.2mB)
ru: Загрузить фон (доступно: %1024.2mB)

source: Upload...
pl_pl: Prześlij...
ru: Загрузить...

source: Wallpaper source
pl_pl: Źródło tapety
ru: Обои

source: You can upload files such as gif/jpg/mp4/png/webm/webp files, to change the login page background.
pl_pl: Możesz przesłać pliki takie jak gif/jpg/mp4/png/webm/webp, aby zmienić tło strony logowania.
ru: Вы можете загрузить файлы gif/jpg/mp4/png/webm/webp, чтобы изменить фон страницы входа.

source: [Dark mode] Frosted Glass Radius
pl_pl: [Ciemny motyw] Stopień rozmycia szkła
ru: [Тёмная тема] Радиус матового стекла

source: [Dark mode] Primary Color
pl_pl: [Ciemny motyw] Kolor podstawowy
ru: [Тёмная тема] Основной цвет

source: [Dark mode] Transparency
pl_pl: [Ciemny motyw] Przezroczystość
ru: [Тёмная тема] Прозрачность

source: [Light mode] Frosted Glass Radius
pl_pl: [Jasny motyw] Stopień rozmycia szkła
ru: [Светлая тема] Радиус матового стекла

source: [Light mode] Primary Color
pl_pl: [Jasny motyw] Kolor podstawowy
ru: [Светлая тема] Основной цвет

source: [Light mode] Transparency
pl_pl: [Jasny motyw] Przezroczystość
ru: [Светлая тема] Прозрачность

source: valid HEX color value
pl_pl: prawidłowy kolor w formacie HEX
ru: корректное значение HEX-цвета
