Repository: kenzok8/openwrt-packages
Catalog: luci-app-amlogic/po/*/amlogic.po
Languages: ru

source: Choose local file:
ru: Выберите локальный файл:

source: Couldn't open file:
ru: Не удалось открыть файл:

source: The file Will download automatically.
ru: Файл будет загружен автоматически.

source: Create upload file error.
ru: Ошибка создания загружаемого файла.

source: Download
ru: Скачать

source: Download file
ru: Скачать файл

source: File name
ru: Имя файла

source: File saved to
ru: Файл сохранён в

source: FileTransfer
ru: Передача файлов

source: Install
ru: Установить

source: Attributes
ru: Атрибуты

source: Modify time
ru: Время изменения

source: No specify upload file.
ru: Не указан файл для загрузки.

source: Path on Route:
ru: Путь на маршрутизаторе:

source: Remove
ru: Удалить

source: Size
ru: Размер

source: Upload
ru: Загрузить

source: Upload file list
ru: Список загруженных файлов

source: There are config file in the upload directory, and you can restore the config.
ru: В каталоге загрузки есть файл конфигурации — вы можете восстановить настройки.

source: There are kernel files in the upload directory, and you can replace the kernel.
ru: В каталоге загрузки находятся файлы ядра — вы можете заменить ядро.

source: There are openwrt firmware file in the upload directory, and you can update the openwrt.
ru: В каталоге загрузки есть файл прошивки OpenWrt — вы можете обновить OpenWrt.

source: Update plugins first, then update the kernel or firmware.
ru: Сначала обновите плагины, затем ядро или прошивку.

source: After uploading [Firmware], [Kernel], [IPK] or [Backup Config], the operation buttons will be displayed.
ru: После загрузки [прошивки], [ядра], [IPK-пакета] или [резервной конфигурации] появятся соответствующие кнопки управления.

source: After uploading firmware (.img/.img.gz/.img.xz/.7z suffix) or kernel files (3 kernel files), the update button will be displayed.
ru: После загрузки файлов прошивки (с расширениями .img/.img.gz/.img.xz/.7z) или файлов ядра (3 файла), появится кнопка обновления.

source: Amlogic Service
ru: Сервис Amlogic

source: Restore Config / Replace OpenWrt Kernel
ru: Восстановить конфигурацию / Заменить ядро OpenWrt

source: Manually Upload Update
ru: Обновление вручную

source: Install OpenWrt
ru: Установить OpenWrt

source: Select the device model:
ru: Выберите модель устройства:

source: Select List
ru: Выбрать из списка

source: Enter the dtb file name
ru: Введите имя файла DTB

source: Enter the soc name:
ru: Введите имя SoC:

source: Enter the uboot_overload name:
ru: Введите имя uboot_overload:

source: Invalid value.
ru: Недопустимое значение.

source: Install OpenWrt:
ru: Установка OpenWrt:

source: Install OpenWrt to EMMC, Please select the device model, Or enter the dtb file name.
ru: Установка OpenWrt на eMMC. Пожалуйста, выберите модель устройства или введите имя файла DTB.

source: Tip: Writing is in progress, and it will automatically restart after completion.
ru: Подсказка: идёт запись — после завершения устройство автоматически перезагрузится.

source: You have chosen:
ru: Вы выбрали:

source: Start install?
ru: Начать установку?

source: Installing...
ru: Установка...

source: Install Failed
ru: Установка не удалась

source: Successful Install
ru: Установка завершена успешно

source: Update
ru: Обновить

source: Updating...
ru: Обновление...

source: Update Failed
ru: Обновление не удалось

source: Successful Update
ru: Обновление завершено успешно

source: Update OpenWrt firmware
ru: Обновить прошивку OpenWrt

source: kernel
ru: ядро

source: Replace OpenWrt Kernel
ru: Заменить ядро OpenWrt

source: Tip: The kernel is being replaced, and it will automatically restart after completion.
ru: Подсказка: идёт замена ядра — после завершения устройство автоматически перезагрузится.

source: Supports management of Amlogic s9xxx, Allwinner (V-Plus Cloud), and Rockchip (BeikeYun, Chainedbox L1 Pro) boxes.
ru: Поддерживает управление устройствами на базе Amlogic s9xxx, Allwinner (V-Plus Cloud) и Rockchip (BeikeYun, Chainedbox L1 Pro).

source: Supported functions:
ru: Поддерживаемые функции:

source: Provide services such as install to EMMC, Update Firmware and Kernel, Backup and Recovery Config, Snapshot management, etc.
ru: Позволяет устанавливать OpenWrt на eMMC, обновлять прошивку и ядро, выполнять резервное копирование и восстановление конфигурации, а также управлять снапшотами (мгновенными снимками системы).

source: Supported Boxes:
ru: Поддерживаемые устройства:

source: Used in KVM ----- [ Can be used in KVM virtual machine of Armbian system. ]
ru: Используется в KVM — [можно использовать в виртуальной машине KVM на базе Armbian].

source: KVM dual system switching
ru: Переключение между двумя системами в KVM

source: You can freely switch between KVM dual partitions, using OpenWrt systems in different partitions.
ru: Вы можете свободно переключаться между двумя разделами KVM, используя OpenWrt из разных разделов.

source: Switch System
ru: Переключить систему

source: System is switching...
ru: Переключение системы...

source: Waiting for system switching...
ru: Ожидание завершения переключения...

source: System switchover succeeded, restarting...
ru: Переключение успешно, перезагрузка...

source: Are you sure you want to switch systems?
ru: Вы уверены, что хотите переключить систему?

source: Install Ipk
ru: Установить IPK

source: Plugin Settings
ru: Настройки плагина

source: Backup Firmware Config
ru: Резервное копирование конфигурации

source: Backup Config:
ru: Резервная копия конфигурации:

source: Download Backup
ru: Скачать резервную копию

source: Backup OpenWrt config (openwrt_config.tar.gz). Use this file to restore the config in [Manually Upload Update].
ru: Создать резервную копию конфигурации OpenWrt (openwrt_config.tar.gz). Используйте этот файл для восстановления в разделе [Обновление вручную].

source: Edit List:
ru: Редактировать список:

source: Open List
ru: Открыть список

source: Backup Configuration - Custom List
ru: Резервная копия — пользовательский список

source: Write one configuration item per line, and directories should end with a /.
ru: По одному элементу на строку. Имена каталогов должны оканчиваться на «/».

source: Restore Backup:
ru: Восстановить из резервной копии:

source: Upload Backup
ru: Загрузить резервную копию

source: Restore
ru: Восстановить

source: Restore Config
ru: Восстановить конфигурацию

source: Restore configuration
ru: Восстановление конфигурации

source: Config File
ru: Файл конфигурации

source: Tip: The config is being restored, and it will automatically restart after completion.
ru: Подсказка: идёт восстановление конфигурации — после завершения устройство автоматически перезагрузится.

source: Snapshot Management
ru: Управление снапшотами

source: Create Snapshot
ru: Создать снапшот

source: Creating...
ru: Создание...

source: Created successfully
ru: Создано успешно

source: Creation failed
ru: Ошибка создания

source: Initialize Snapshot
ru: Инициализировать снапшот

source: Update Snapshot
ru: Обновить снапшот

source: Restore Snap
ru: Восстановить снапшот

source: Restoring...
ru: Восстановление...

source: Restore Failed
ru: Восстановление не удалось

source: Successfully Restored
ru: Восстановлено успешно

source: Delete Snap
ru: Удалить снапшот

source: You selected a snapshot:
ru: Вы выбрали снапшот:

source: Confirm delete?
ru: Подтвердить удаление?

source: Confirm recovery and restart OpenWrt?
ru: Подтвердить восстановление и перезагрузку OpenWrt?

source: Delete Failed
ru: Удаление не удалось

source: Successfully Deleted
ru: Удалено успешно

source: Create a snapshot of the current system configuration, or restore to a snapshot.
ru: Создать снапшот текущей конфигурации системы или восстановиться из снапшота.

source: Currently OpenWrt does not support the snapshot function.
ru: В текущей версии OpenWrt функция снапшотов не поддерживается.

source: Please use this plugin to reinstall or upgrade OpenWrt to enable the snapshot function.
ru: Пожалуйста, используйте этот плагин для переустановки или обновления OpenWrt, чтобы включить поддержку снапшотов.

source: Deleting...
ru: Удаление...

source: Online Download Update
ru: Обновление через интернет

source: Config Source
ru: Источник конфигурации

source: You can customize the github.com download repository of OpenWrt files and kernels in [Online Download Update].
ru: Вы можете настроить репозиторий на github.com для загрузки файлов OpenWrt и ядер в разделе [Обновление через интернет].

source: Tip: The same files as the current OpenWrt system's BOARD (such as rock5b) and kernel (such as 5.10) will be downloaded.
ru: Подсказка: будут загружены файлы, соответствующие текущей платформе (например, rock5b) и версии ядра (например, 5.10).

source: OpenWrt download repository:
ru: Репозиторий OpenWrt:

source: Set the OpenWrt files download repository on github.com in [Online Download Update].
ru: Укажите репозиторий на github.com для загрузки файлов OpenWrt в разделе [Обновление через интернет].

source: OpenWrt download tags keyword:
ru: Ключевое слово тега OpenWrt:

source: Set the OpenWrt files download tags keyword for github.com in [Online Download Update].
ru: Укажите ключевое слово тега для загрузки файлов OpenWrt на github.com в разделе [Обновление через интернет].

source: OpenWrt files suffix:
ru: Расширение файлов OpenWrt:

source: Set the OpenWrt files download suffix for github.com in [Online Download Update].
ru: Укажите расширение файлов OpenWrt, загружаемых с github.com, в разделе [Обновление через интернет].

source: Kernel download repository:
ru: Репозиторий ядра:

source: Set the kernel files download repository on github.com in [Online Download Update].
ru: Укажите репозиторий на github.com для загрузки файлов ядра в разделе [Обновление через интернет].

source: Kernel download tags:
ru: Теги ядра:

source: Set the kernel files download tags on github.com in [Online Download Update].
ru: Укажите теги для загрузки файлов ядра на github.com в разделе [Обновление через интернет].

source: kernel_rk3588 [Rockchip RK3588 Kernel]
ru: kernel_rk3588 [Ядро для Rockchip RK3588]

source: kernel_rk35xx [Rockchip RK35xx Kernel]
ru: kernel_rk35xx [Ядро для Rockchip RK35xx]

source: kernel_stable [Mainline Stable Kernel]
ru: kernel_stable [Стабильное ядро из mainline]

source: kernel_flippy [Mainline Stable Kernel by Flippy]
ru: kernel_flippy [Стабильное ядро от Flippy]

source: kernel_h6 [Allwinner H6 Kernel]
ru: kernel_h6 [Ядро для Allwinner H6]

source: kernel_beta [Beta Kernel]
ru: kernel_beta [Бета-версия ядра]

source: Set version branch:
ru: Ветка версии:

source: Set the version branch of the OpenWrt files and kernel selected in [Online Download Update].
ru: Укажите ветку версии для файлов OpenWrt и ядра в разделе [Обновление через интернет].

source: Keep config update:
ru: Сохранять конфигурацию при обновлении:

source: Set whether to keep the current config during [Online Download Update] and [Manually Upload Update].
ru: Выберите, сохранять ли текущую конфигурацию при обновлении через интернет или вручную.

source: Auto write bootloader:
ru: Автоматически записывать bootloader:

source: [Recommended choice] Set whether to auto write bootloader during install and update OpenWrt.
ru: [Рекомендуется] Указывает, записывать ли автоматически bootloader при установке или обновлении OpenWrt.

source: Set the file system type:
ru: Тип файловой системы:

source: [Default ext4] Set the file system type of the shared partition (/mnt/mmcblk*p4) when install OpenWrt.
ru: [По умолчанию ext4] Укажите тип файловой системы для общего раздела (/mnt/mmcblk*p4) при установке OpenWrt.

source: Save Config:
ru: Сохранить конфигурацию:

source: Save
ru: Сохранить

source: Check All Components Update
ru: Проверка обновлений

source: Provide OpenWrt Firmware, Kernel and Plugin online check, download and update service.
ru: Предоставляет онлайн-проверку, загрузку и обновление прошивки OpenWrt, ядра и плагинов.

source: Only update Amlogic Service
ru: Обновить только сервис Amlogic

source: Update system kernel only
ru: Обновить только ядро системы

source: Complete system update
ru: Полное обновление системы

source: Check Update
ru: Проверить обновления

source: Checking...
ru: Проверка...

source: Current Version
ru: Текущая версия

source: Latest Version
ru: Последняя версия

source: Rescue Kernel
ru: Аварийное восстановление ядра

source: When a kernel update fails and causes the OpenWrt system to be unbootable, the kernel can be restored by mutual recovery from eMMC/NVMe/sdX.
ru: Если обновление ядра привело к невозможности загрузки OpenWrt, его можно восстановить с другого носителя (eMMC/NVMe/sdX).

source: Rescue the original system kernel
ru: Восстановить исходное ядро системы

source: Rescuing...
ru: Восстановление...

source: Current Device:
ru: Текущее устройство:

source: Display the PLATFORM classification of the device.
ru: Отображает класс PLATFORM устройства.

source: Update plugins first, then update the kernel or firmware. More options can be configured in [Plugin Settings].
ru: Сначала обновите плагины, затем ядро или прошивку. Дополнительные настройки доступны в [Настройках плагина].

source: Collecting data...
ru: Сбор данных...

source: Server Logs
ru: Журнал операций

source: Display the execution log of the current operation.
ru: Отображает журнал выполнения текущей операции.

source: Stop Refresh Log
ru: Остановить обновление журнала

source: Start Refresh Log
ru: Начать обновление журнала

source: Clean Log
ru: Очистить журнал

source: Download Log
ru: Скачать журнал

source: CPU Settings
ru: Настройки CPU

source: CPU Freq
ru: Частота CPU

source: CPU Freq Settings
ru: Настройки частоты CPU

source: Set CPU Scaling Governor to Max Performance or Balance Mode
ru: Выберите режим управления частотой CPU: максимальная производительность или баланс.

source: CPU Scaling Governor:
ru: Режим управления частотой:

source: ondemand
ru: Ondemand — автоматический баланс

source: performance
ru: Performance — максимальная производительность

source: schedutil
ru: Schedutil — умный планировщик

source: CPU Freq from 48000 to 716000 (Khz)
ru: Диапазон частоты CPU: от 48000 до 716000 КГц

source: Min Freq:
ru: Мин. частота:

source: Max Freq:
ru: Макс. частота:

source: CPU Switching Threshold:
ru: Порог переключения частоты CPU:

source: Kernel make a decision on whether it should increase the frequency (%)
ru: При загрузке CPU выше указанного процента (%), ядро увеличит частоту.

source: CPU Switching Sampling rate:
ru: Период проверки частоты CPU:

source: The sampling rate determines how frequently the governor checks to tune the CPU (ms)
ru: Частота проверки загрузки CPU (мс). Примечание: слишком частое переключение может вызвать дрожание задержек в сети.

source: Microarchitectures:
ru: Микроархитектура:

source: Loading
ru: Загрузка

source: PowerOff
ru: Выключить

source: Shut down your router device.
ru: Выключить устройство маршрутизатора.

source: Perform PowerOff
ru: Выполнить выключение

source: Are you sure you want to shut down?
ru: Вы уверены, что хотите выключить устройство?

source: Device is shutting down...
ru: Устройство выключается...

source: Waiting for the device to shut down...
ru: Ожидание завершения выключения...

source: The device has been turned off
ru: Устройство выключено
